Revit 2024 API
OpenOptions.IgnoreExtensibleStorageSchemaConflict Property
 Specifies whether to ignore the error of schema conflict.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool IgnoreExtensibleStorageSchemaConflict { get; set; }
Visual Basic
Public Property IgnoreExtensibleStorageSchemaConflict As Boolean
	Get
	Set
Visual C++
public:
property bool IgnoreExtensibleStorageSchemaConflict {
	bool get ();
	void set (bool value);
}
Remarks
 The default is false. Setting this to true will ignore the exception of schema conflict while opening the model. Data in the existing schema with the same ID will be erased from the model.
See Also
OpenOptions Class
Autodesk.Revit.DB Namespace